In [1]:
import numpy as np

In [2]:
import random

In [3]:
random.random()

0.5177969378482996

In [6]:
for _ in range(10):
    print(random.randrange(1,3))

1
2
2
2
2
1
1
2
1
1

In [7]:
for _ in range(10):
    print(random.randint(1,3))

3
3
3
3
3
2
1
3
3
2

In [8]:
from datetime import datetime

In [9]:
today = datetime.now()
print(today)

2024-03-05 09:22:33.401908

In [10]:
today

datetime.datetime(2024, 3, 5, 9, 22, 33, 401908)

In [11]:
datetime.strftime(today,'%Y/%m/%d %H:%M:%S')

'2024/03/05 09:22:33'

In [12]:
dt = datetime(2024,2,1)

In [13]:
print(dt.year)
print(dt.month)
print(dt.day)

2024
2
1

In [15]:
print(dt.date())

2024-02-01

In [16]:
dt.weekday()

3

In [17]:
import calendar

In [21]:
calendar.day_name[3]

'Thursday'

In [22]:
monthInfo = calendar.monthrange(2024,2)
print(monthInfo)

(3, 29)

In [23]:
import numpy as np

In [24]:
import pandas as pd

In [25]:
a = np.array([1,2,3,4])
b = np.array([[1,2,3],[4,5,6]])

In [28]:
print(a.shape)
print(b.shape)
print(b[0])

(4,)
(2, 3)
[1 2 3]

In [33]:
gisa = pd.read_csv('Abc1115.csv',header=None)

In [34]:
gisa.columns

Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10], dtype='int64')

In [35]:
gisa.shape

(1000, 11)

In [37]:
gisa.head(10)

       0     1   2   3   4   5   6    7  8  9  10
0  990001  addx  17  29  16  49  43  154  C  A  C
1  990002  stch  30   9  48  25  81  193  C  A  A
2  990003  gali  93  60   6  84  36  279  A  C  A
3  990004  miat  73  22  48  24  72  239  B  C  C
4  990005  oran  33  38  59  58  28  216  C  B  A
5  990006  sj24  27  65  54  77  33  256  B  A  A
6  990007  kor2  33  85  98  60  66  342  A  B  A
7  990008  vsky  41   5  99  14  67  226  C  A  C
8  990009  kimd  74   4   1  33  53  165  B  C  A
9  990010  blue  55  84  50  89  37  315  A  B  A

In [38]:
gisa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       1000 non-null   int64
 1   1       1000 non-null   object
 2   2       1000 non-null   int64
 3   3       1000 non-null   int64
 4   4       1000 non-null   int64
 5   5       1000 non-null   int64
 6   6       1000 non-null   int64
 7   7       1000 non-null   int64
 8   8       1000 non-null   object
 9   9       1000 non-null   object
 10  10      1000 non-null   object
dtypes: int64(7), object(4)
memory usage: 86.1+ KB

In [39]:
gisa.columns = ['stdNo','email','kor','eng','math','sci','hist','total','mgrCode','accCode','locCode']

In [40]:
gisa.head(3)

    stdNo email  kor  eng  math  sci  hist  total mgrCode accCode locCode
0  990001  addx   17   29    16   49    43    154       C       A       C
1  990002  stch   30    9    48   25    81    193       C       A       A
2  990003  gali   93   60     6   84    36    279       A       C       A

In [47]:
gisa_sort = gisa.sort_values(by=['total','stdNo'], ascending=[False,True])

In [48]:
gisa_sort.head(10)

      stdNo email  kor  eng  math  sci  hist  total mgrCode accCode locCode
363  990364  ywjs   88   81   100   84    81    434       B       C       A
50   990051  soor   94   98    85   64    75    416       A       B       A
421  990422  itkz   93   97    74   69    80    413       C       B       B
38   990039  huff   52   99    97   87    72    407       A       C       A
658  990659  pete  100   98    77   44    85    404       B       C       C
752  990753  firs   82   58    93   86    83    402       A       C       B
864  990865  hysu   54   96    96   55    95    396       C       A       A
709  990710  kleo   85   87    49   76    98    395       B       C       B
13   990014  oldn   83   89    67   67    87    393       B       C       A
439  990440  gino   59   67    91   81    95    393       A       B       A

In [50]:
gisa[['kor','eng','math']].head()

   kor  eng  math
0   17   29    16
1   30    9    48
2   93   60     6
3   73   22    48
4   33   38    59

In [52]:
gisa.iloc[1:4,:3]

    stdNo email  kor
1  990002  stch   30
2  990003  gali   93
3  990004  miat   73

In [53]:
gisa[gisa['total']>=400]

      stdNo email  kor  eng  math  sci  hist  total mgrCode accCode locCode
38   990039  huff   52   99    97   87    72    407       A       C       A
50   990051  soor   94   98    85   64    75    416       A       B       A
363  990364  ywjs   88   81   100   84    81    434       B       C       A
421  990422  itkz   93   97    74   69    80    413       C       B       B
658  990659  pete  100   98    77   44    85    404       B       C       C
752  990753  firs   82   58    93   86    83    402       A       C       B

In [56]:
gisa['quiz1']= gisa.apply(lambda row : row['kor']+row.math, axis=1)

In [57]:
gisa.head(3)

,stdNo,email,kor,eng,math,sci,hist,total,mgrCode,accCode,locCode,quiz1
0,990001,addx,17,29,16,49,43,154,C,A,C,33
1,990002,stch,30,9,48,25,81,193,C,A,A,78
2,990003,gali,93,60,6,84,36,279,A,C,A,99

In [58]:
gisa.head(3)

,stdNo,email,kor,eng,math,sci,hist,total,mgrCode,accCode,locCode,quiz1
0,990001,addx,17,29,16,49,43,154,C,A,C,33
1,990002,stch,30,9,48,25,81,193,C,A,A,78
2,990003,gali,93,60,6,84,36,279,A,C,A,99

In [59]:
gisa_1 = gisa[gisa.locCode=='B']

In [60]:
gisa_1.head()

,stdNo,email,kor,eng,math,sci,hist,total,mgrCode,accCode,locCode,quiz1
20,990021,equi,13,95,56,93,88,345,B,C,B,69
22,990023,tess,86,71,87,6,15,265,B,C,B,173
24,990025,lyj2,24,90,72,29,52,267,B,A,B,96
25,990026,netm,65,4,4,23,45,141,B,C,B,69
28,990029,minh,3,11,89,71,88,262,B,C,B,92

In [61]:
answer = gisa_1.sort_values(by=['quiz1','stdNo'], ascending=[False,True])

In [65]:
answer[4:5].stdNo

329    990330
Name: stdNo, dtype: int64

In [66]:
answer.iloc[4,0]

990330

In [68]:
gisa_1['quiz1'].max()

189

In [69]:
gisa_3 = gisa[(gisa.eng+gisa.math)>=120]

In [70]:
gisa_3.head(3)

,stdNo,email,kor,eng,math,sci,hist,total,mgrCode,accCode,locCode,quiz1
6,990007,kor2,33,85,98,60,66,342,A,B,A,131
9,990010,blue,55,84,50,89,37,315,A,B,A,105
10,990011,moja,43,69,68,23,92,295,B,A,C,111

In [71]:
gisa_3['point'] = gisa_3.accCode.map({'A':5,'B':15,'C':20})

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_14356\2212051763.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gisa_3['point'] = gisa_3.accCode.map({'A':5,'B':15,'C':20})

In [73]:
gisa_3.head(3)

,stdNo,email,kor,eng,math,sci,hist,total,mgrCode,accCode,locCode,quiz1,point
6,990007,kor2,33,85,98,60,66,342,A,B,A,131,15
9,990010,blue,55,84,50,89,37,315,A,B,A,105,15
10,990011,moja,43,69,68,23,92,295,B,A,C,111,5

In [74]:
(gisa_3['total']+gisa_3['point']).sum()

99549

In [77]:
gisa_3.total.sum()+gisa_3.point.sum()

99549

In [76]:
gisa_3.point.sum()

4165

In [78]:
gisa_3['point2']=gisa_3.apply(lambda row : 5 if row.accCode=='A' else 15 if row.accCode=='B' else 20,axis=1)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_14356\1990788822.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gisa_3['point2']=gisa_3.apply(lambda row : 5 if row.accCode=='A' else 15 if row.accCode=='B' else 20,axis=1)

In [79]:
gisa_3.head(3)

,stdNo,email,kor,eng,math,sci,hist,total,mgrCode,accCode,locCode,quiz1,point,point2
6,990007,kor2,33,85,98,60,66,342,A,B,A,131,15,15
9,990010,blue,55,84,50,89,37,315,A,B,A,105,15,15
10,990011,moja,43,69,68,23,92,295,B,A,C,111,5,5

In [81]:
gisa_4 = gisa[(gisa.accCode=='A') | (gisa.accCode=='B')]

In [82]:
gisa_4['point'] = gisa_4.locCode.map({'A':5,'B':10,'C':15})

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_14356\1790417945.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gisa_4['point'] = gisa_4.locCode.map({'A':5,'B':10,'C':15})

In [84]:
gisa_4.head(10)

,stdNo,email,kor,eng,math,sci,hist,total,mgrCode,accCode,locCode,quiz1,point
0,990001,addx,17,29,16,49,43,154,C,A,C,33,15
1,990002,stch,30,9,48,25,81,193,C,A,A,78,5
4,990005,oran,33,38,59,58,28,216,C,B,A,92,5
5,990006,sj24,27,65,54,77,33,256,B,A,A,81,5
6,990007,kor2,33,85,98,60,66,342,A,B,A,131,5
7,990008,vsky,41,5,99,14,67,226,C,A,C,140,15
9,990010,blue,55,84,50,89,37,315,A,B,A,105,5
10,990011,moja,43,69,68,23,92,295,B,A,C,111,15
12,990013,lore,77,85,36,95,46,339,B,A,C,113,15
14,990015,sire,66,45,86,93,48,338,C,B,A,152,5

In [87]:
gisa_4[(gisa_4.kor+gisa_4.point)>=50].stdNo.count()

397